requests/voip_access.xml

<ns0:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.deltasolutions.ru/om/rt/LyraOmsService/">
    <ns0:Header />
    <ns0:Body>
        <ns1:SubmitOrderRequest>
            <Components>

                <Component>
                    <Attributes>
                        <Attribute>
                            <Name>cfs_spec_id</Name>
                            <Value>voip_access</Value>
                        </Attribute>
                        <Attribute>
                            <Name>department_id</Name>
                            <Value>33</Value>
                        </Attribute>
                        <Attribute>
                            <Name>city</Name>
                            <Value>33</Value>
                        </Attribute>
                        <Attribute>
                            <Name>street</Name>
                            <Value>606</Value>
                        </Attribute>
                        <Attribute>
                            <Name>house</Name>
                            <Value>48</Value>
                        </Attribute>
                        <Attribute>
                            <Name>building</Name>
                            <Value>2</Value>
                        </Attribute>
                        <Attribute>
                            <Name>flat</Name>
                            <Value>129</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_name</Name>
                            <Value>КРОФТ СЕМЕН ИЛЬИЧ</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_type</Name>
                            <Value>3</Value>
                        </Attribute>
                        <Attribute>
                            <Name>local_idn_set</Name>
                            <Value>1</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_id</Name>
                            <Value>325352243</Value>
                        </Attribute>
                        <Attribute>
                            <Name>rtpl_id</Name>
                            <Value>34890</Value>
                        </Attribute>
                        <Attribute>
                            <Name>prcl_id</Name>
                            <Value>160280</Value>
                        </Attribute>
                        <Attribute>
                            <Name>virtual_number</Name>
                            <Value>2000012</Value>
                        </Attribute>
                        <Attribute>
                            <Name>nri_rnabn</Name>
                            <Value>11081141</Value>
                        </Attribute>
                        <Attribute>
                            <Name>connection_scheme</Name>
                            <Value>17</Value>
                        </Attribute>
                        <Attribute>
                            <Name>action_code</Name>
                            <Value>1</Value>
                        </Attribute>
                        <Attribute>
                            <Name>contract_id</Name>
                            <Value>2215008</Value>
                        </Attribute>
                        <Attribute>
                            <Name>lyra_one_time_service_id</Name>
                            <Value>60098</Value>
                        </Attribute>
                        <Attribute>
                            <Name>instance_id</Name>
                            <Value>1770</Value>
                        </Attribute>
                        <Attribute>
                            <Name>installation_order_id</Name>
                            <Value>180</Value>
                        </Attribute>
                        <Attribute>
                            <Name>tx_id</Name>
                            <Value>1005</Value>
                        </Attribute>
						<Attribute>
                            <Name>telex</Name>
                            <Value>1005</Value>
                        </Attribute>
                        <Attribute>
                            <Name>installation_date</Name>
                            <Value>2015-11-12T00:00:00+06:00</Value>
                        </Attribute>
                        <Attribute>
                            <Name>installation_interval</Name>
                            <Value>10:00-12:00</Value>
                        </Attribute>
                        <Attribute>
                            <Name>need_installation</Name>
                            <Value>1</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_birth_date</Name>
                            <Value>2015-07-03T00:00:00+06:00</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_birth_place</Name>
                            <Value>г. Пермь</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_pass_date</Name>
                            <Value>2015-07-03T00:00:00+06:00</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_pass_num</Name>
                            <Value>638221</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_pass_place</Name>
                            <Value>ОРДЖОН-М РОВД ГОР ПЕРМИ</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_pass_ser</Name>
                            <Value>5703</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_phone</Name>
                            <Value>143420932354</Value>
                        </Attribute>
                        <Attribute>
                            <Name>zip</Name>
                            <Value>614104</Value>
                        </Attribute>
                        <Attribute>
                            <Name>delivery_date</Name>
                            <Value>2015-07-03T00:00:00+06:00</Value>
                        </Attribute>
                        <Attribute>
                            <Name>order_start_date</Name>
                            <Value>2015-10-07T00:00:00+06:00</Value>
                        </Attribute>
                    <Attribute>
                            <Name>order_action_type</Name>
                            <Value>PR</Value>
                        </Attribute>
                        <Attribute>
                            <Name>service_receiver</Name>
                            <Value>2</Value>
                        </Attribute>
                        <Attribute>
                            <Name>pack_id</Name>
                            <Value>26900</Value>
                        </Attribute>
                        <Attribute>
                            <Name>main_connection_scheme</Name>
                            <Value>171</Value>
                        </Attribute>
						<Attribute>
                            <Name>subs_eak_id</Name>
                            <Value>171</Value>
                        </Attribute>
						<Attribute>
                            <Name>bis_additional_attr</Name>
                            <Value>&lt;GUP_ATTRS>&lt;Framed-IP-Address/>&lt;/GUP_ATTRS></Value>
                        </Attribute>
					</Attributes>
                </Component>
            </Components>
            <CommonData>
                <Attributes>
                    <Attribute>
                        <Name>main_virtual_number</Name>
                        <Value>2000010</Value>
                    </Attribute>
                </Attributes>
            </CommonData>
        </ns1:SubmitOrderRequest>
    </ns0:Body>
</ns0:Envelope>